SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG26/Include/efr32mg26b311f3200il136.h
/* Part number capabilities */
#define ACMP_PRESENT                                         /** ACMP is available in this part */
#define ACMP_COUNT                                        2  /** 2 ACMPs available  */
#define AMUXCP_PRESENT                                       /** AMUXCP is available in this part */
#define AMUXCP_COUNT                                      1  /** 1 AMUXCPs available  */
#define BURAM_PRESENT                                        /** BURAM is available in this part */
#define BURAM_COUNT                                       1  /** 1 BURAMs available  */
#define BURTC_PRESENT                                        /** BURTC is available in this part */
#define BURTC_COUNT                                       1  /** 1 BURTCs available  */
#define CMU_PRESENT                                          /** CMU is available in this part */
#define CMU_COUNT                                         1  /** 1 CMUs available  */
#define DCDC_PRESENT                                         /** DCDC is available in this part */
#define DCDC_COUNT                                        1  /** 1 DCDCs available  */
#define DMEM_PRESENT                                         /** DMEM is available in this part */
#define DMEM_COUNT                                        2  /** 2 DMEMs available  */
#define DPLL_PRESENT                                         /** DPLL is available in this part */
#define DPLL_COUNT                                        1  /** 1 DPLLs available  */
#define EMU_PRESENT                                          /** EMU is available in this part */
#define EMU_COUNT                                         1  /** 1 EMUs available  */
#define EUSART_PRESENT                                       /** EUSART is available in this part */
#define EUSART_COUNT                                      4  /** 4 EUSARTs available  */
#define FSRCO_PRESENT                                        /** FSRCO is available in this part */
#define FSRCO_COUNT                                       1  /** 1 FSRCOs available  */
#define GPCRC_PRESENT                                        /** GPCRC is available in this part */
#define GPCRC_COUNT                                       1  /** 1 GPCRCs available  */
#define GPIO_PRESENT                                         /** GPIO is available in this part */
#define GPIO_COUNT                                        1  /** 1 GPIOs available  */
#define HFRCO_PRESENT                                        /** HFRCO is available in this part */
#define HFRCO_COUNT                                       1  /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                                    /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                                   1  /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                                         /** HFXO is available in this part */
#define HFXO_COUNT                                        1  /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT                                  /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT                                 1  /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT                                          /** I2C is available in this part */
#define I2C_COUNT                                         4  /** 4 I2Cs available  */
#define IADC_PRESENT                                         /** IADC is available in this part */
#define IADC_COUNT                                        1  /** 1 IADCs available  */
#define ICACHE_PRESENT                                       /** ICACHE is available in this part */
#define ICACHE_COUNT                                      1  /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT                                      /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT                                     1  /** 1 KEYSCANs available  */
#define LCD_PRESENT                                          /** LCD is available in this part */
#define LCD_COUNT                                         1  /** 1 LCDs available  */
#define LCDRF_PRESENT                                        /** LCDRF is available in this part */
#define LCDRF_COUNT                                       1  /** 1 LCDRFs available  */
#define LDMA_PRESENT                                         /** LDMA is available in this part */
#define LDMA_COUNT                                        1  /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                                     /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                                    1  /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                                      /** LETIMER is available in this part */
#define LETIMER_COUNT                                     1  /** 1 LETIMERs available  */
#define LFRCO_PRESENT                                        /** LFRCO is available in this part */
#define LFRCO_COUNT                                       1  /** 1 LFRCOs available  */
#define LFXO_PRESENT                                         /** LFXO is available in this part */
#define LFXO_COUNT                                        1  /** 1 LFXOs available  */
#define MSC_PRESENT                                          /** MSC is available in this part */
#define MSC_COUNT                                         1  /** 1 MSCs available  */
#define PCNT_PRESENT                                         /** PCNT is available in this part */
#define PCNT_COUNT                                        1  /** 1 PCNTs available  */
#define PRS_PRESENT                                          /** PRS is available in this part */
#define PRS_COUNT                                         1  /** 1 PRSs available  */
#define RADIOAES_PRESENT                                     /** RADIOAES is available in this part */
#define RADIOAES_COUNT                                    1  /** 1 RADIOAESs available  */
#define SEMAILBOX_PRESENT                                    /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                                   1  /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                          /** SMU is available in this part */
#define SMU_COUNT                                         1  /** 1 SMUs available  */
#define SYSCFG_PRESENT                                       /** SYSCFG is available in this part */
#define SYSCFG_COUNT                                      1  /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT                                       /** SYSRTC is available in this part */
#define SYSRTC_COUNT                                      1  /** 1 SYSRTCs available  */
#define TIMER_PRESENT                                        /** TIMER is available in this part */
#define TIMER_COUNT                                       10 /** 10 TIMERs available  */
#define ULFRCO_PRESENT                                       /** ULFRCO is available in this part */
#define ULFRCO_COUNT                                      1  /** 1 ULFRCOs available  */
#define USART_PRESENT                                        /** USART is available in this part */
#define USART_COUNT                                       3  /** 3 USARTs available  */
#define VDAC_PRESENT                                         /** VDAC is available in this part */
#define VDAC_COUNT                                        2  /** 2 VDACs available  */
#define WDOG_PRESENT                                         /** WDOG is available in this part */
#define WDOG_COUNT                                        2  /** 2 WDOGs available  */
#define DEVINFO_PRESENT                                      /** DEVINFO is available in this part */
#define DEVINFO_COUNT                                     1  /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
#include "core_cm33.h"        /* Core Header File */
#include "system_efr32mg26.h" /* System Header File */

/** @} End of group EFR32MG26B311F3200IL136_Part */

/**************************************************************************//**
 * @defgroup EFR32MG26B311F3200IL136_Peripheral_TypeDefs EFR32MG26B311F3200IL136 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efr32mg26_emu.h"
#include "efr32mg26_cmu.h"
#include "efr32mg26_burtc.h"
#include "efr32mg26_hfrco.h"
#include "efr32mg26_fsrco.h"
#include "efr32mg26_dpll.h"
#include "efr32mg26_lfxo.h"
#include "efr32mg26_lfrco.h"
#include "efr32mg26_ulfrco.h"
#include "efr32mg26_keyscan.h"
#include "efr32mg26_msc.h"
#include "efr32mg26_icache.h"
#include "efr32mg26_prs.h"
#include "efr32mg26_gpio.h"
#include "efr32mg26_ldma.h"
#include "efr32mg26_ldmaxbar.h"
#include "efr32mg26_timer.h"
#include "efr32mg26_mpahbram.h"
#include "efr32mg26_syscfg.h"
#include "efr32mg26_buram.h"
#include "efr32mg26_gpcrc.h"
#include "efr32mg26_eusart.h"
#include "efr32mg26_dcdc.h"
#include "efr32mg26_mailbox.h"
#include "efr32mg26_usart.h"
#include "efr32mg26_sysrtc.h"
#include "efr32mg26_i2c.h"
#include "efr32mg26_lcd.h"
#include "efr32mg26_lcdrf.h"
#include "efr32mg26_aes.h"
#include "efr32mg26_smu.h"
#include "efr32mg26_letimer.h"
#include "efr32mg26_iadc.h"
#include "efr32mg26_acmp.h"
#include "efr32mg26_amuxcp.h"
#include "efr32mg26_vdac.h"
#include "efr32mg26_pcnt.h"
#include "efr32mg26_hfxo.h"
#include "efr32mg26_wdog.h"
#include "efr32mg26_semailbox.h"
#include "efr32mg26_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "efr32mg26_prs_signals.h"
#include "efr32mg26_dma_descriptor.h"
#include "efr32mg26_ldmaxbar_defines.h"

